export type FAQDataType = {
  content: string | string[];
  title: string;
};

export const FAQData: FAQDataType[] = [
  {
    content:
      "QR-код размещён на коробке с торцевой стороны. Просто поверните упаковку и найдите квадратный код в чёрно-белом рисунке. Отсканируйте его камерой смартфона.",
    title: "Как найти QR-код для работы с набором?",
  },
  {
    content: [
      "Откройте приложение «Камера»",
      "Наведите камеру на QR-код так, чтобы он полностью попал в кадр",
      "На экране в районе QR-кода появится всплывающая ссылка. Нажмите на нее, чтобы перейти к инструкции.",
    ],
    title: "Как отсканировать QR-код на устройстве iPhone?",
  },
  {
    content: [
      "Откройте приложение «Камера» (на большинстве современных телефонов функция сканирования встроена)",
      "Наведите камеру на QR-код",
      "На экране появится всплывающая ссылка — нажмите на неё, чтобы открыть",
    ],
    title: "Как отсканировать QR-код на устройстве Android?",
  },
  {
    content: "LALALLALLALALALLALALL ALALLALALLALALALLALLALALLALLAL ALALLALALAL",
    title:
      "Что делать, если при сканировании штрихкода на контейнере/пробирке приложение выдает ошибку?",
  },
  {
    content: [
      "Накануне сдачи анализа рекомендуется не употреблять овощи и фрукты, которые могут изменить цвет мочи (свекла, морковь и пр.), не принимать диуретики.",
      "Произведите тщательный гигиенический туалет половых органов (без использования моющих средств).",
      "Проводить забор только в контейнер, который входит в состав набора.",
      "Забор делать утром после пробуждения, первую порцию слить (1-2 секунды) и только затем, не прекращая мочеиспускания, произвести забор в контейнер. Для проведения анализа достаточно 50–100 мл. мочи.",
      "Исключите употребление алкоголя за сутки до сдачи мочи.",
      "Исключите половые контакты за 12 часов до сдачи.",
      "Женщинам не рекомендуется сдавать анализ мочи во время менструации, а также в течение 2 суток после ее окончания.",
    ],
    title: "Как подготовиться к сбору анализа мочи?",
  },
  {
    content: "wdefrgtyu67i8i9op;lokiujhygtrfew",
    title: "Как подготовиться к сбору анализа слюны?",
  },
  {
    content: "sqwdefrghnjmk",
    title:
      "Как подготовиться к сбору буккального эпителия (мазок со внутренней стороны щеки)?",
  },
  {
    content: "sqdwefrgh",
    title: "Какие пункты самостоятельной доставки работают?",
  },
];
